unload/cf/Catalogs/ВСД_ХозСубъект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ВСД_ХозСубъект</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарамКолонкаСортировкиПартииСписания</Name>
					<Comment>Сортировка Актуальных Партий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарамЗнакСортировкиУбывание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Страна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Регион</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Город</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеПараметрыСписанияПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

unload/cf/Catalogs/ВСД_ХозСубъект/Forms/ЗагрузкаПоИНН/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗагруженныеХозсубъекты") Тогда
		выбКонтрагент = Параметры.ЗагруженныеХозсубъекты.Контрагент;
		Организация = Параметры.ЗагруженныеХозсубъекты.Организация;
		ХозсубъектыСписок.Очистить();
		Для Каждого Хозсубъект Из Параметры.ЗагруженныеХозсубъекты.МассивХозсубъектов Цикл
			НоваяСтрока = ХозсубъектыСписок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Хозсубъект);
		КонецЦикла;
		Элементы.ПолеИнформация.Заголовок = "По ИНН """ + выбКонтрагент.ИНН + """ 
				| в ГИС Меркурий найдено " + Параметры.ЗагруженныеХозсубъекты.МассивХозсубъектов.Количество() + " хозсубъекта,
				| выберите к какому хозяйствующему субъекту привязать контрагента """ + выбКонтрагент.Наименование + """";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХозсубъектыСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	СтрокаТч = ХозсубъектыСписок[ВыбраннаяСтрока];
	Если ЗначениеЗаполнено(СтрокаТч.Хозсубъект) Тогда
		ДополнительныеПараметры = Новый Структура("Контрагент, GUID, ПараметрыОрганизации", выбКонтрагент, СтрокаТч.GUID, ПараметрыОрганизации);
		Оповещение = Новый ОписаниеОповещения("ВыбратьХозсубъектОтвет", ЭтаФорма, ДополнительныеПараметры);
		ТекстВопроса = "Уже имеются загруженные хозсубъекты с GUID [ " + СтрокаТч.GUID + " ],
		| открыть список загруженных хозсубъектов для связи с контрагентом: """ + выбКонтрагент + """?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "");
	Иначе
		ВыбраннаяСтрока.ХозСубъект = кб99_ВСД.НайтиХозСубъект(выбКонтрагент);
		кб99_ВСД_Запросы.Площадка_ЗагрузитьПоХозСубъекту(ПараметрыОрганизации, СтрокаТч.ХозСубъект, Истина);
		Оповестить("ХозсубъектЗагружен");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьХозсубъектОтвет(Ответ,Парам) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораЗагруженногоХозСубъекта", ЭтаФорма.ВладелецФормы, Парам);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("GUID", Парам.GUID);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, Отбор", Истина, Истина, Ложь, СтруктураОтбора);
		ОткрытьФорму("Справочник.ВСД_ХозСубъект.ФормаВыбора", ПараметрыПодбора, ЭтаФорма,,,, ОповещениеОЗакрытии);
		Закрыть();
	Иначе
		ХозСубъект = кб99_ВСД.НайтиХозСубъект(Парам.Контрагент);
		кб99_ВСД_Запросы.Площадка_ЗагрузитьПоХозСубъекту(Парам.ПараметрыОрганизации, ХозСубъект, Истина);
		Оповестить("ХозсубъектЗагружен");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
